Strömungssimulation/Beleg/simulationen/wärmeübertrager_2/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// What to extrude:
//      patch   : from patch of another case ('sourceCase')
//      mesh    : as above but with original case included
//      surface : from externally read surface

constructFrom patch;
sourceCase "./meshing";
sourcePatches (zMax);

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName zMax;

// Flip surface normals before usage. Valid only for extrude from surface or
// patch.
flipNormals false;

//- Linear extrusion in point-normal direction
extrudeModel        linearDirection;


nLayers             1;

expansionRatio      1.0;

linearDirectionCoeffs
{
    direction	    (0 0 1);
    // INFO: Hier wird die "Dicke" des 2D Gitters eingestellt. Das wirkt sich z.B. auf Flächenintegrale aus.
    thickness       0.02;
}

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;   // true;

// Merge small edges. Fraction of bounding box.
mergeTol 0;




// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
