Strömungssimulation/Beleg/simulationen/wärmeübertrager_2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// DONE: Geben Sie die gewünschte Anströmgeschwindigkeit "meanVelo" an. Die hier definierte Variable wird unten verwendet.
meanVelo	2.0;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($meanVelo 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
    inlet
    {
        type            fixedValue;
        value           uniform ($meanVelo 0 0);
    }
    // DONE: Wählen Sie eine geeignete RB
    outlet
    {
        type            zeroGradient;
    }
    // DONE: Wählen Sie eine geeignete RB
    // INFO: Der Ausdruck "pipe.*" bezeichnet alle Patches, deren Name mit "pipe" beginnt
    "pipe.*"
    {
        type            noSlip;
    }

}

// ************************************************************************* //
