Strömungssimulation/Beleg/simulationen/wärmeübertrager_2/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.329358 -0.0449837 0)
(-0.32996 -0.0450632 3.91909e-20)
(-0.366195 -0.0484216 0)
(-0.365567 -0.0483394 0)
(-0.365567 0.0483394 0)
(-0.32996 0.0450632 -3.91909e-20)
(-0.314543 -0.0338434 1.37633e-20)
(-0.394982 -0.0265115 2.49061e-20)
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.402612 0.00927072 -9.93336e-21)
(-0.394882 0.0264934 0)
(-0.403448 -0.0092817 -0)
(-0.394953 -0.0264905 -0)
(-0.394716 0.0264708 0)
(-0.329979 -0.0450675 -3.99774e-20)
(-0.315292 0.0339313 0)
(-0.329153 -0.0449554 1.31726e-20)
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.315002 -0.033895 -1.48996e-20)
(-0.329246 -0.044968 -2.18675e-20)
(-0.329753 0.0450349 -4.32471e-20)
(-0.329271 0.0449729 -1.26104e-20)
(-0.3654 0.0483178 3.06265e-20)
(-0.394351 -0.0264448 0)
(-0.365279 -0.0483005 0)
(-0.366024 0.0483997 -3.85511e-20)
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.395364 0.0265142 0)
(-0.394381 0.0264465 1.89847e-20)
(-0.365372 0.0483129 0)
(-0.365958 -0.0483914 3.85444e-20)
(-0.329318 0.0449813 2.1874e-20)
(-0.329723 -0.0450323 -0)
(-0.365368 -0.0483097 -3.06213e-20)
(-0.329208 -0.0449609 1.26028e-20)
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.365597 0.0483394 0)
(-0.366198 0.0484237 0)
(-0.329988 0.0450687 0)
(-0.32932 -0.0449711 -1.78886e-20)
(-0.315142 0.0339108 0)
(-0.329988 -0.0450687 0)
(-0.366198 -0.0484237 0)
(-0.365597 -0.0483394 0)
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.329168 -0.0449568 0)
(-0.315243 -0.0339209 0)
(-0.314576 0.0338477 -7.63849e-21)
(-0.365982 -0.048395 6.88519e-20)
(-0.329984 0.0450685 3.99687e-20)
(-0.394785 -0.0264742 -3.01368e-20)
(-0.400912 -0.00922813 0)
(-0.394825 -0.0264769 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
