Strömungssimulation/Beleg/simulationen/wärmeübertrager_2/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
3.64237
3.639
3.63896
3.64207
3.64207
3.639
3.64279
3.63998
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.63574
3.64047
3.63198
3.64016
3.64127
3.63892
3.63851
3.6435
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.64015
3.64298
3.64015
3.64286
3.6429
3.64296
3.64352
3.6398
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.63828
3.64282
3.64306
3.64012
3.64263
3.64033
3.64311
3.64316
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
3.64197
3.63892
3.63887
3.64247
3.63935
3.63887
3.63892
3.64197
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.64341
3.63876
3.64261
3.64
3.6389
3.64095
3.64344
3.64077
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
